stianeklund/RemoteRadioDisplay/sdkconfig.defaults.esp32s3
# ESP32-S3 specific configuration (Sunton ESP32-8048S050C)

CONFIG_IDF_TARGET="esp32s3"

# SPIRAM: OctalSPI mode
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# SPIRAM allocation thresholds
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192

# CPU and Cache
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y

# WiFi memory optimizations (reduced for SRAM conservation on S3)
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=2
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=4
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=2
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=4
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP32_WIFI_AMSDU_TX_ENABLED=n

# RGB LCD configuration
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_GDMA_ISR_IRAM_SAFE=y

# PSRAM XIP - Critical for RGB LCD stability
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# I2C ISR IRAM-safe for flash cache disabled scenarios
CONFIG_I2C_ISR_IRAM_SAFE=y

# LVGL Port: use PPA for rotation
CONFIG_LVGL_PORT_ENABLE_PPA=y
